def shelp():

    helplist=['..!help',
              '..抽',
              '..抽正妹',
              '..抽鮮肉',
              '..抽塔羅/抽塔羅牌',
              '..抽塔羅3張/抽塔羅牌3張',
              '..抽塔羅5張/抽塔羅牌5張',             
              '..查天氣縣市 ex查天氣台北市',
              '..輸入美金、日幣可查匯率',
              '..1000=美金 (查TWD換匯',
              '..美金=100 (查美金換TWD',
              '..查空氣品質',
              '..天氣特報',
              '..查颱風',
              '..抽籤',
              '..星座名　ex天秤座',
              '..抽金句',
              '..time',
              '..time20180101',
              '..time2017010113',
              '..現在吃什麼',
              '..查股市',
              '..查股票股號 ex查股號鴻海',
              '..抽歡歌',
              '..抽歡歌UID',
              '..18啦',
              '..拉霸',
              '..聽歌+關鍵字 (查youtube影片',
              '..youtube熱門',
              '..youtube華語',
              '..聽歌華語',
              '..聽歌台語',
              '..蘋果新聞',
              '..看電影',
              '..看電影+電影名',
              '..本週上映',
              '..查集點',
              '..查咖啡',
              '..PTTHOT',
              '..PTT笨版',
              '..PTT表特',
              '..即時廢文',
              '..傳送LINE座標 (查附近的餐廳'            
]
    content = ""
    for i in helplist:
        a = '{}\n'.format(i)
        content += a
       
    return content
    


if __name__ == '__main__':
    print(shelp())
