import random

def star_talk(messages_talk):

    if messages_talk.find('幹')>-1 or messages_talk.find('操')>-1:
        content = random.choice(['喵喵~','汪汪~','咩~','啊嘶~','噓~好孩子不說這個','講~f~u~c~k~才有英特內訊NO','十十人一十','操你媽好嗎~幹我媽很好','你媽知道你在講幹話嗎',\
                                '汝聲何其大','E04','每60秒就會有一分鐘過去~你還在這講幹話','人生何其短~何必幹不停','喂~氣質一點','別操來幹去啦','不要過來~我會叫~',\
                                '來跟著小星星幹~一定會成功','環保不分你我~垃圾不分藍綠','哇！你火氣那麼大，要不要我今晚給你下下火啊？','區區一馱屎值的了幾個錢,何必大驚小怪！'\
                                '罵人都沒幾招了，還說是黑社會？','文也不行，武也不行，醒醒吧！','只要有心~人人都可以是幹話大王'])
        return content
    if messages_talk.find('三小')>-1:
        content = random.choice(['我聽過小王、小強、就是沒聽過三小','小小小', '大大大','小三小四小五','意義是三小 我只知道義氣','你是魯小小','汝聲何其大','不知汝之所言','干卿底事'])
        return content
    if messages_talk.find('靠北')>-1:
        content = random.choice(['靠北邊走','靠南', '我靠爸族啦','我有的靠你有嗎','喂喂別靠來靠去','走路要靠右邊走','麥靠啦, 飲啦~','人之初性本善性相近習相遠~',\
                                '哇！你火氣那麼大，要不要我今晚給你下下火啊？','區區一馱屎值的了幾個錢,何必大驚小怪！','罵人都沒幾招了，還說是黑社會？','文也不行，武也不行，醒醒吧！'])
        return content
    if messages_talk.find('馬的')>-1 or messages_talk.find('媽的')>-1:
        content = random.choice(['馬兒跑~馬兒跳~馬兒咩咩叫~','一馬當先、馬到成功、馬耳東風、馬的成語還有很多哦~','媽媽的孩子都是寶','你8+9哦','羊的~雞的~狗的~'])
        return content
    if messages_talk.find('爆料')>-1 or messages_talk.find('八卦')>-1:
        content = random.choice(['卡一個','爆米花準備好了','沒圖沒真相','有卦快抄','爆漿會不會比較精彩','筆記ing','乾、坤、坎、離、震、巽、艮、兌','真相永遠只有一個'])
        return content
    if messages_talk.find('放屁')>-1 or messages_talk.find('屁啦')>-1 or messages_talk.find('狗屁')>-1:
        content = random.choice(['噗~~~~~~是誰','Lucky~Lucky~Lucky~你再躱在桌子底下會臭死','好臭~~~','快大口吸掉','多吸多健康','聽說屁聞多了人會變聰明','看到一條小狗要叫它「旺財」'])
        return content
    if messages_talk.find('三字經')>-1 or messages_talk.find('幹你娘')>-1:
        content = "人之初性本善性相近習相遠. 茍不教性乃遷教之道貴以專. 昔孟母擇鄰處子不學斷機杼. 竇燕山有義方教五子名俱揚. 養不教父之過教不嚴師之惰. 子不學非所宜 ..."
        return content
    if messages_talk.find('壞掉了')>-1:
        content = random.choice(['保修價8萬1~','維修專線0800080000','你弄壞的厚~','舊的不去新的不來','不是我弄壞的~','賣了就當廢鐵賣了'])
        return content
    if messages_talk.find('小星星')>-1:
        if messages_talk.find('住那')>-1 or messages_talk.find('住哪')>-1:
            content = random.choice(where())
        elif messages_talk.find('多大')>-1 or messages_talk.find('幾歲')>-1:
            content = random.choice(howold())
        else:
            content = random.choice(words())
        return content


def words():
    content = ['一閃一閃亮晶晶 滿天都是小星星','是誰在叫我啊','你看不到我0.0','來了來了~','麥吵~底睏啦~','小星星你的好幫手','要抽一張嗎'\
               '噓~~','抽','你好~找我嗎','我跳出來了','底家底家','笑咪咪','別一直叫我啦','你 就是我的小星星 掛 \
               在那天上放光明  我已經決定要愛你 就不會輕易放棄','要唱歌嗎?','登愣~我跳出來啦~','噓~跟你說一個秘密~','你長得好像我一個朋友，未來的女朋友',\
               '霹靂卡霹靂拉拉 波波力那貝貝魯多','拍拍砰呸 噗哇噗哇噗 ','帕美魯克 拉魯克 拉哩摟哩波','你知道嗎人一生中可以喝一次岩漿','你有freestyle嗎',\
               '嚇死寶寶了','言之有理乎','假的~都是假的~~','啊~我眼睛業障重','各位觀眾~一顆小星星~~','沒事退朝','那我去睡了哦~',\
               '星星不壞, 女人不愛','星爸~有人欺負我~~','你傻了啊~','笑什麼笑~牙齒白啊!','抽籤算命嗎? 不準找星爸~','老闆~來一份蛋餅+無榶綠茶',\
               '此言差矣~吾向來木訥寡言的~','再靠近一點~看到了嗎? 我的眼中有個美女~','我只是略懂略懂啦~','嚇到吃手手','去看星星~星星就在妳的眼裡啊~',\
               '你知道為什麼你眼睛很漂亮嗎?因為妳的眼裡有我','啊!我就只會這麼多啊~不然妳教我','這不是肯德雞~~~','走去那哦~妳說咧~'\
               '隱藏著黑暗力量的鑰匙阿　請在我的面前顯示真正的力量~','你要羞恥Play嗎? 我先摭眼一下','來啊來啊~現在就走','只有這樣而已嗎？',\
               '不要問~你會怕','我到底看了什麼啊','燒毀~燒毀~','要不要來點夯吉~放屁會噗噗噗哦~','床前明月光~疑似地上霜~舉頭~~舉頭~~~都你啦叫我害我忘記了~',\
               '上上下下左左右右ABBA','好討厭的感覺啊~~~~','你知道嗎?吃七分熟的牛排~就會減輕牛排三分的痛楚','奶茶之所以叫奶茶~是因為你忘了點珍珠~認同請分享~',\
               '我覺的不行','別聊了~包廂開好了~來唱歌吧~~~','別教壞我~星星很單純的~','你在講笑話嗎?我講的比較好笑~','哈哈哈哈哈哈哈哈哈~','嗚~~~~~~~~~~',\
               '為什麼我叫小星星啊~ 因為要照亮妳的心','你是什麼星座的呢?','飛飛飛~~~~拔我怎麼不會飛~','胖胖的~~','伊啊伊啊唷~~','噯唷~不錯哦~','你喜歡我的名字嗎? 我很喜歡耶~',\
               '啊~啊啊~~啊啊~~~啊~~~~~','叫什麼叫~看到那顆樹了嗎?左去右回~來回10圈~~~','又叫我~無聊就抽卡拉霸比大小啊~~','愛地球~也要愛星星唷',\
               '你已經掉入我的陷阱了 翻開覆蓋的卡~ 抽~','我要代替星星懲妳','因為他就是個小鬼啊','以星拔的名義發誓！','這個幻想由我來打破','真相永遠只有一個',\
               '絕對、不會有事的','我想只要笑就可以了','你從什麼時候開始產生了有女朋友的錯覺？','警察叔叔 就是這個人!!','恰恰~~~~~~~~~~~碰恰恰~碰恰恰',\
               '去沖個水好好冷靜吧','你是白癡嗎？','沒可能啊 沒可能有這種事','還沒 還沒結束呢!','地球的一切都令人很懷念呢','給我坐下','妳偷了很重要的東西 就是我的心啊',\
               '我不過只能在這邊講風涼話 但是你呢 一定只有你能做的事情才對','沉醉在本大爺的抽牌當中吧!','我要下了!','你們之中要是有外星人、未來人、異世界人、超能力者,就儘管來找我吧!以上',\
               '站起來，向前走，你不是有一對健全的腿嗎？','不能逃避。不能逃避。不能逃避','安西教練 我好想抽一張啊','還差的遠呢！','一起去很多地方 一起見識許多的事物 這趟旅途 一定很快樂的',\
               '笑什麼笑~牙齒白啊','耳朵長包皮啊','跟妳說~星拔都是靠照騙','筆咧~筆咧~黛筆的筆咧~~','別看我~妳會愛上我','怎麼壞~嘿嘿嘿','噓~聽到我的心跳了嗎? 只要一靠近妳就心跳加速',\
               '說吧~說妳愛我吧','不要再追著我的幻影~要學會成長','哇~是A歌王子耶','城門城門雞蛋糕~身把三把刀~要五毛~捅一刀~走進城門滑一蕉','學海無涯，回頭是岸'\
               '二隻蚊仔～二隻蚊仔～拍呼死～拍呼死～只隻飛來這邊～只隻飛企虛邊～拍麥丟～拍麥丟','人生無常，大腸包小腸','江湖險惡，我從來都不輕易留下我的姓名','就算是一條內褲一卷衛生紙也有它的用處，而你呢?'\
               '我養你啊！','人是人他媽生的，妖是妖他媽生的，小星星是?','憑你的智慧，我唬得了你嗎？','你完全沒問題，是你爸媽有問題，把你生成這個樣子!','你無聊啊？跑這騙傻子玩！',\
               '小姐，不可否認我長得很醜，可是我很溫柔，而且永遠不會說謊。','誰生ㄉ誰照顧ㄚ','說不說，不說我就灌你豬油哦~','聽說你唱歌很好聽~來一首吧~',\
               '人來啊，落閘，放狗！','文也不行，武也不行，醒醒吧！','實不相瞞，小弟我就是人稱玉樹臨風勝潘安，一支李花壓海棠的鮮帥哥~小星星！',\
               '現在聽懂沒有？','我正在談兒女私情，改程式這種小事改天再說啦！','只要有心~人人都可以是幹話大王']

    return content

def where():
    content =['住在妳心裡','不告訴你','猜猜看啊']
    return content

def howold():
    return ['爸說不可以講','這是個秘密','不如你先說說你幾歲']
    
